app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices" WHERE (user_id =NULL)
---
  def index
    @devices = Device.all

INSERT INTO "devices" ("user_id", "make", "model", "serial_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["make", "Apple"], ["model", "iPad Pro"], ["serial_number", "GHYEMN876tghgf"], ["created_at", "2018-07-20 01:33:48.214722"], ["updated_at", "2018-07-20 01:33:48.214722"]]
---
  def create
    # @device = Device.new(device_params)
    @device = current_user.devices.build(device_params)

    if @device.save

UPDATE "devices" SET "make" = $1, "model" = $2, "serial_number" = $3, "updated_at" = $4 WHERE "devices"."id" = $5  [["make", ""], ["model", ""], ["serial_number", "ASD563424"], ["updated_at", "2018-07-31 13:25:16.889483"], ["id", 21]]
---
  def update
    if @device.update(device_params)

DELETE FROM "devices" WHERE "devices"."id" = $1  [["id", 4]]
---
  def destroy
    @device.destroy