app/controllers/repair_orders_controller.rb

  def index
    @repair_orders = RepairOrder.all
---
SELECT "repair_orders".* FROM "repair_orders"

  def create
    # @repair_order = RepairOrder.new(repair_order_params)
    @repair_order = current_user.repair_orders.build(repair_order_params)

    if @repair_order.save
---
INSERT INTO "repair_orders" ("device_id", "user_id", "complaint", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["device_id", 28], ["user_id", 2], ["complaint", "Very Loud while playing GTA V"], ["created_at", "2018-07-30 23:50:31.768146"], ["updated_at", "2018-07-30 23:50:31.768146"]]

  def update
    if @repair_order.update(repair_order_params)
---
UPDATE "repair_orders" SET "date_due" = $1, "complaint" = $2, "diagnosis" = $3, "updated_at" = $4 WHERE "repair_orders"."id" = $5  [["date_due", "2018-07-21"], ["complaint", "Cracked screen"], ["diagnosis", "Broken display"], ["updated_at", "2018-07-20 02:39:14.914065"], ["id", 1]]

  def destroy
    @repair_order.destroy
---
DELETE FROM "repair_orders" WHERE "repair_orders"."id" = $1  [["id", 1]]

    def set_repair_order
      @repair_order = RepairOrder.find(params[:id])
---
SELECT  "repair_orders".* FROM "repair_orders" WHERE "repair_orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]